Revit 2026 API

# BuiltInFailuresSplineFailures Class

---

Failures about Spline.

SystemObject Autodesk.Revit.DBBuiltInFailuresSplineFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class SplineFailures
```
```vb
Public NotInheritable Class SplineFailures
```
```cpp
public ref class SplineFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type SplineFailures = class end
```

The BuiltInFailuresSplineFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CannotCreateSpline | Can't make Spline. |
|  | ClosedSpline | Closed or self-intersecting splines are not allowed. |

#### Reference

Autodesk.Revit.DB Namespace